app/controllers/authors_controller.rb

SELECT * FROM "authors" WHERE (feed_id = NULL)
---
  def index
    @authors = Author.all

SELECT * FROM "authors" WHERE ("authors"."name" IS NULL) LIMIT 1
---
  def show
    @author = Author.find_by_name(params[:id])

SELECT * FROM "authors" WHERE ("authors"."id" = 980190962)
---
  def edit
    @author = Author.find(params[:id])

INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES(NULL, '2010-10-30 07:19:21', '2010-10-30 07:19:21')
---
  def create
    @author = Author.new(params[:author])

    respond_to do |format|
      if @author.save

SELECT * FROM "authors" WHERE ("authors"."id" = 980190962)
---
  def update
    @author = Author.find(params[:id])

SELECT * FROM "authors" WHERE ("authors"."id" = 9)
DELETE FROM "authors" WHERE "id" = 9
---
  def destroy
    @author = Author.find(params[:id])
    @author.destroy