app/controllers/authors_controller.rb

SELECT * FROM "authors" WHERE ("authors"."id" = 1)
---
  def show
    @author = Author.find(params[:id])