app/controllers/posts_controller.rb

SELECT * FROM "posts" WHERE ("posts"."feed_id" = '2' AND "posts"."author_id" = '1')
SELECT avg("posts".rating) AS avg_rating FROM "posts" WHERE ("posts".author_id = 1)
---
  def get_feed_author
    @posts = Post.find(:all, :conditions => { :feed_id => params[:feed_id], :author_id => params[:author_id]})

SELECT * FROM "posts" WHERE ("posts".author_id = 1) LIMIT 1
SELECT avg("posts".rating) AS avg_rating FROM "posts" WHERE ("posts".author_id = 1)
---
  def index
    @posts = Post.all

SELECT * FROM "posts" WHERE ("posts".author_id = 1) LIMIT 1
SELECT avg("posts".rating) AS avg_rating FROM "posts" WHERE ("posts".author_id = 1)
SELECT * FROM "authors" WHERE ("authors"."id" = 1)
---
  def show

    @posts = Post.find(:all, :conditions => { :feed_id => params[:id]})
    @post_authors = @posts.group_by{ |a| a.author}

INSERT INTO "posts" ("rating", "created_at", "body", "updated_at", "author_id") VALUES(NULL, '2010-10-30 07:32:57', NULL, '2010-10-30 07:32:57', NULL)
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 980190962)
---
  def update
    @post = Post.find(params[:id])